hazy1k/EDA_Base/入门项目/CW32充电检测仪/充电检测仪程序/8 USB充电检测仪（不含关断功能  LCD能正常显示）/Libraries/inc/cw32l010_sysctrl.h
#define SYSCTRL_HEX_ENPOL_HIGH                       (0x00000000U)
#define SYSCTRL_HEX_ENPOL_LOW                        (bv7)

#define SYSCTRL_HSE_MODE_OSC                        (0x00000000U)
#define SYSCTRL_HSE_MODE_CLK                        bv6
#define IS_SYSCTRL_HSE_MODE(INSTANCE)               (((INSTANCE) == SYSCTRL_HSE_MODE_OSC) ||\
                                                 ((INSTANCE) == SYSCTRL_HSE_MODE_CLK))


#define SYSCTRL_HSE_WAITCYCLE_8192                      (0x00000000U)
#define SYSCTRL_HSE_WAITCYCLE_32768                     ((uint32_t)(0x1UL << SYSCTRL_HSE_WAITCYCLE_Pos))
#define SYSCTRL_HSE_WAITCYCLE_131072                     ((uint32_t)(0x2UL << SYSCTRL_HSE_WAITCYCLE_Pos))
#define SYSCTRL_HSE_WAITCYCLE_262144                     ((uint32_t)(0x3UL << SYSCTRL_HSE_WAITCYCLE_Pos))

#define SYSCTRL_HSE_DRIVER_LEVEL0                       ((uint32_t)(0x0UL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL1                       ((uint32_t)(0x1UL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL2                       ((uint32_t)(0x2UL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL3                       ((uint32_t)(0x3UL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL4                       ((uint32_t)(0x4UL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL5                       ((uint32_t)(0x5UL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL6                       ((uint32_t)(0x6UL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL7                       ((uint32_t)(0x7UL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL8                       ((uint32_t)(0x8UL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL9                       ((uint32_t)(0x9UL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL10                      ((uint32_t)(0xAUL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL11                      ((uint32_t)(0xBUL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL12                      ((uint32_t)(0xCUL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL13                      ((uint32_t)(0xDUL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL14                      ((uint32_t)(0xEUL << SYSCTRL_HSE_DRIVER_Pos))
#define SYSCTRL_HSE_DRIVER_LEVEL15                      ((uint32_t)(0xFUL << SYSCTRL_HSE_DRIVER_Pos))

#define SYSCTRL_HSE_FLT_CLOSE                         (0U)
#define SYSCTRL_HSE_FLT_OPEN                          (1U << SYSCTRL_HSE_DIGFLT_Pos)


/* SYSCTRL LSE --------------------------------------------------------*/
#define SYSCTRL_LSE_PINLOCKEN                        (bv17)
#define SYSCTRL_LSE_PINLOCKDIS                        (0UL)

#define SYSCTRL_LSE_RESTRIM_35M                       0UL
#define SYSCTRL_LSE_RESTRIM_25M                       (1UL  << SYSCTRL_LSE_RESTRIM_Pos)
#define SYSCTRL_LSE_RESTRIM_20M                       (1UL  << SYSCTRL_LSE_RESTRIM_Pos)
#define SYSCTRL_LSE_RESTRIM_10M                       (1UL  << SYSCTRL_LSE_RESTRIM_Pos)

#define SYSCTRL_LSE_CAP_ENHANCE                      0UL
#define SYSCTRL_LSE_CAP_NORMAL                       (1UL << SYSCTRL_LSE_CPEN_Pos)

#define SYSCTRL_LSE_COMP_40nA                        0UL
#define SYSCTRL_LSE_COMP_80nA                        bv12

#define SYSCTRL_LSE_PDRIVER_LEVEL0                       ((uint32_t)(0x0UL << SYSCTRL_LSE_PDRIVER_Pos))
#define SYSCTRL_LSE_PDRIVER_LEVEL1                       ((uint32_t)(0x1UL << SYSCTRL_LSE_PDRIVER_Pos))
#define SYSCTRL_LSE_PDRIVER_LEVEL2                       ((uint32_t)(0x2UL << SYSCTRL_LSE_PDRIVER_Pos))
#define SYSCTRL_LSE_PDRIVER_LEVEL3                       ((uint32_t)(0x3UL << SYSCTRL_LSE_PDRIVER_Pos))
#define SYSCTRL_LSE_PDRIVER_LEVEL4                       ((uint32_t)(0x4UL << SYSCTRL_LSE_PDRIVER_Pos))
#define SYSCTRL_LSE_PDRIVER_LEVEL5                       ((uint32_t)(0x5UL << SYSCTRL_LSE_PDRIVER_Pos))
#define SYSCTRL_LSE_PDRIVER_LEVEL6                       ((uint32_t)(0x6UL << SYSCTRL_LSE_PDRIVER_Pos))
#define SYSCTRL_LSE_PDRIVER_LEVEL7                       ((uint32_t)(0x7UL << SYSCTRL_LSE_PDRIVER_Pos))
#define SYSCTRL_LSE_PDRIVER_LEVEL8                       ((uint32_t)(0xEUL << SYSCTRL_LSE_PDRIVER_Pos))
#define SYSCTRL_LSE_PDRIVER_LEVEL9                       ((uint32_t)(0xFUL << SYSCTRL_LSE_PDRIVER_Pos))

#define SYSCTRL_LSE_ANAFLT_DIS                      bv7

#define SYSCTRL_LSE_MODE_OSC                           (0x00000000U)
#define SYSCTRL_LSE_MODE_CLK                           (bv6)
#define IS_SYSCTRL_LSE_MODE(INSTANCE)                  (((INSTANCE) == SYSCTRL_LSE_MODE_OSC)         ||\
                                                   ((INSTANCE) == SYSCTRL_LSE_MODE_CLK))

#define SYSCTRL_LSE_WAITCYCLE_256                      (0x00000000U)
#define SYSCTRL_LSE_WAITCYCLE_1024                     ((uint32_t)(1UL << SYSCTRL_LSE_WAITCYCLE_Pos))
#define SYSCTRL_LSE_WAITCYCLE_4096                     ((uint32_t)(2UL << SYSCTRL_LSE_WAITCYCLE_Pos))
#define SYSCTRL_LSE_WAITCYCLE_16384                    ((uint32_t)(3UL << SYSCTRL_LSE_WAITCYCLE_Pos))


#define SYSCTRL_LSE_DRIVER_LEVEL0                      (0x00000000U)
#define SYSCTRL_LSE_DRIVER_LEVEL1                      (0x00000001U)
#define SYSCTRL_LSE_DRIVER_LEVEL2                      (0x00000002U)
#define SYSCTRL_LSE_DRIVER_LEVEL3                      (0x00000003U)
#define SYSCTRL_LSE_DRIVER_LEVEL4                      (0x00000004U)
#define SYSCTRL_LSE_DRIVER_LEVEL5                      (0x00000005U)
#define SYSCTRL_LSE_DRIVER_LEVEL6                      (0x00000006U)
#define SYSCTRL_LSE_DRIVER_LEVEL7                      (0x00000007U)
#define SYSCTRL_LSE_DRIVER_LEVEL8                      (0x00000008U)
#define SYSCTRL_LSE_DRIVER_LEVEL9                      (0x00000009U)
#define SYSCTRL_LSE_DRIVER_LEVEL10                     (0x0000000aU)
#define SYSCTRL_LSE_DRIVER_LEVEL11                     (0x0000000bU)
#define SYSCTRL_LSE_DRIVER_LEVEL12                     (0x0000000cU)
#define SYSCTRL_LSE_DRIVER_LEVEL13                     (0x0000000dU)
#define SYSCTRL_LSE_DRIVER_LEVEL14                     (0x0000000eU)
#define SYSCTRL_LSE_DRIVER_LEVEL15                     (0x0000000fU)

